benchmarks/general/fuzzy.yml
config:
  target: "CONDUIT_URL"
  phases:
    - arrivalRate: 30
      duration: 10
  http:
    extendedMetrics: true
  plugins:
#    Use for random string generation
    fuzzer: {}
scenarios:
  - flow:
      - log: "Generic request"
      - get:
          url: "/"
          headers:
            clientid: "REPLACE_ME"
            clientsecret: "REPLACE_ME"

